In [1]:
import seaborn as sns
import numpy as np
import pandas as pd
import acquire
from sklearn import preprocessing

## Classification Exercises: Acquire Data

### Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
df_iris = sns.load_dataset('iris')

print the first 3 rows

In [3]:
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

print the number of rows and columns (shape)

In [4]:
print(f'df_iris has {df_iris.shape[0]} rows and {df_iris.shape[1]} columns.')

df_iris has 150 rows and 5 columns.

print the column names

In [5]:
df_iris.columns.to_list()

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

print the data type of each column

In [6]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

print the summary statistics for each of the numeric variables.

In [7]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

Would you recommend rescaling the data based on these statistics?

> No, the features have a small range, and are all pretty similar in size.

### Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [8]:
df_excel = pd.read_excel('Spreadsheets_Exercises_Solutions.xlsx', sheet_name='Table1_CustDetails')

df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes

assign the first 100 rows to a new dataframe, df_excel_sample

In [9]:
df_excel_sample = df_excel.head(100)

print the number of rows of your original dataframe

In [10]:
df_excel.shape[0]

7049

print the first 5 column names

In [11]:
df_excel.columns.tolist()[:5]

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

print the column names that have a data type of object

In [12]:
df_excel.select_dtypes(include='object').columns.tolist()

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

compute the range for each of the numeric variables.

In [13]:
nums = df_excel.select_dtypes(include='number')
print(nums.max() - nums.min())

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

### Read the data from this google sheet into a dataframe, df_google

In [14]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

print the first 3 rows

In [15]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

print the number of rows and columns

In [16]:
print(f'df_google has {df_google.shape[0]} rows and {df_google.shape[1]} columns.')

df_google has 891 rows and 12 columns.

print the column names

In [17]:
df_google.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

print the data type of each column

In [18]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

print the summary statistics for each of the numeric variables

In [19]:
df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

print the unique values for each of your categorical variables

In [20]:
df_google.Name.value_counts(dropna=False)

Panula, Mr. Jaako Arnold                              1
Troupiansky, Mr. Moses Aaron                          1
Oreskovic, Miss. Marija                               1
Cameron, Miss. Clear Annie                            1
Kink-Heilmann, Miss. Luise Gretchen                   1
                                                     ..
Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)    1
Reeves, Mr. David                                     1
Milling, Mr. Jacob Christian                          1
Ball, Mrs. (Ada E Hall)                               1
Pekoniemi, Mr. Edvard                                 1
Name: Name, Length: 891, dtype: int64

In [21]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [22]:
df_google.Ticket.value_counts(dropna=False)

CA. 2343             7
347082               7
1601                 7
3101295              6
CA 2144              6
                    ..
2648                 1
347063               1
347071               1
STON/O 2. 3101286    1
243880               1
Name: Ticket, Length: 681, dtype: int64

In [23]:
df_google.Cabin.value_counts(dropna=False)

NaN            687
B96 B98          4
C23 C25 C27      4
G6               4
E101             3
              ...
E31              1
D6               1
C104             1
D19              1
A36              1
Name: Cabin, Length: 148, dtype: int64

In [24]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

## Iris Data

### Use the function defined in acquire.py to load the iris data.

In [25]:
iris = acquire.get_iris_data()
iris.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### Drop the species_id and measurement_id columns.

In [26]:
iris = iris.drop(columns=(['species_id', 'measurement_id']))
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species_name
0           5.1          3.5           1.4          0.2       setosa
1           4.9          3.0           1.4          0.2       setosa
2           4.7          3.2           1.3          0.2       setosa
3           4.6          3.1           1.5          0.2       setosa
4           5.0          3.6           1.4          0.2       setosa

### Rename the species_name column to just species.

In [27]:
iris = iris.rename(columns={'species_name': 'species'})
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

### Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?

In [28]:
encoded_values = sorted(list(iris.species.unique()))
le = preprocessing.LabelEncoder()
iris_enc = le.fit_transform(iris.species)
iris_array = np.array(iris_enc).reshape(len(iris_enc), 1)
ohe = preprocessing.OneHotEncoder(sparse=False, categories='auto')
iris_ohe = ohe.fit_transform(iris_array)
iris_enc = pd.DataFrame(data=iris_ohe, columns=encoded_values, index=iris.index)
iris = iris.join(iris_enc)
iris.head()

,sepal_length,sepal_width,petal_length,petal_width,species,setosa,versicolor,virginica
0,5.1,3.5,1.4,0.2,setosa,1.0,0.0,0.0
1,4.9,3.0,1.4,0.2,setosa,1.0,0.0,0.0
2,4.7,3.2,1.3,0.2,setosa,1.0,0.0,0.0
3,4.6,3.1,1.5,0.2,setosa,1.0,0.0,0.0
4,5.0,3.6,1.4,0.2,setosa,1.0,0.0,0.0

> inverse_transform would be useful if we wanted to use those labels as the name of the columns we encoded; or if we wanted to go back to our original data in the future.

### Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [29]:
def ohe_encode_iris(df):
    encoded_values = sorted(list(df.species.unique()))
    le = preprocessing.LabelEncoder()
    iris_enc = le.fit_transform(df.species)
    iris_array = np.array(iris_enc).reshape(len(iris_enc), 1)
    ohe = preprocessing.OneHotEncoder(sparse=False, categories='auto')
    iris_ohe = ohe.fit_transform(iris_array)
    iris_enc = pd.DataFrame(data=iris_ohe, columns=encoded_values, index=df.index)
    iris = df.join(iris_enc)
    return df

In [30]:
def prep_iris(df):
    """
    Takes in original iris df generated by acquire.get_iris_data() and returns
    a new df with transformations.
    Drops columns ['species_id', 'measurement_id'] since they aren't useful.
    Renames ['species_name'] to 'species' 
    Encodes species column as one_hot variables
    Splits the df into 80% train set, 20% test set
    """
    
    df = df.drop(columns=['species_id', 'measurement_id'])
    df = df.rename(columns={'species_name': 'species'})
    df = ohe_encode_iris(df)
    train, test = split_my_data(df)
    return train, test

In [31]:
iris2 = acquire.get_iris_data()
train, test = acquire.prep_iris(iris2)

train.head()

,sepal_length,sepal_width,petal_length,petal_width,species,setosa,versicolor,virginica
97,6.2,2.9,4.3,1.3,versicolor,0.0,1.0,0.0
64,5.6,2.9,3.6,1.3,versicolor,0.0,1.0,0.0
126,6.2,2.8,4.8,1.8,virginica,0.0,0.0,1.0
98,5.1,2.5,3.0,1.1,versicolor,0.0,1.0,0.0
90,5.5,2.6,4.4,1.2,versicolor,0.0,1.0,0.0

## Titanic Data

### Use the function you defined in acquire.py to load the titanic data set.

In [32]:
titanic = acquire.get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

### Handle the missing values in the embark_town and embarked columns.

In [33]:
titanic.embark_town = titanic.embark_town.fillna('Southampton')
titanic.embarked = titanic.embarked.fillna('S')

### Remove the deck column.

In [34]:
titanic = titanic.drop(columns='deck')

### Use a label encoder to transform the embarked column.

In [35]:
encoded_values = sorted(list(titanic.embarked.unique()))
le = preprocessing.LabelEncoder()
titanic_enc = le.fit_transform(titanic.embarked)
titanic_array = np.array(titanic_enc).reshape(len(titanic_enc), 1)
ohe = preprocessing.OneHotEncoder(sparse=False, categories='auto')
titanic_ohe = ohe.fit_transform(titanic_array)
titanic_enc = pd.DataFrame(data=titanic_ohe, columns=encoded_values, index=titanic.index)
titanic = titanic.join(titanic_enc)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0.0,0.0,1.0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,1.0,0.0,0.0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0.0,0.0,1.0
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0.0,0.0,1.0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0.0,0.0,1.0

### Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

In [36]:
X = titanic[['age', 'fare']]

scaler = preprocessing.MinMaxScaler(copy=True, feature_range=(0,1)).fit(X)
X = scaler.transform(X)

X = pd.DataFrame(X)
X.head()

          0         1
0  0.271174  0.014151
1  0.472229  0.139136
2  0.321438  0.015469
3  0.434531  0.103644
4  0.434531  0.015713

In [37]:
titanic['age_mm'] = X.iloc[:, :1]
titanic['fare_mm'] = X.iloc[:, 1:2]
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S,age_mm,fare_mm
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0.0,0.0,1.0,0.271174,0.014151
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,1.0,0.0,0.0,0.472229,0.139136
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0.0,0.0,1.0,0.321438,0.015469
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0.0,0.0,1.0,0.434531,0.103644
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0.0,0.0,1.0,0.434531,0.015713

> The age and fare ranges are highly skewed, and scaling these columns centers the data, approximating a normal distribution. You might not want to use this when the data is a boolean, or sparse.

### Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.

In [39]:
def ohe_encode_titanic(df):
    encoded_values = sorted(list(df.embarked.unique()))
    le = preprocessing.LabelEncoder()
    titanic_enc = le.fit_transform(df.embarked)
    titanic_array = np.array(titanic_enc).reshape(len(titanic_enc), 1)
    ohe = preprocessing.OneHotEncoder(sparse=False, categories='auto')
    titanic_ohe = ohe.fit_transform(titanic_array)
    titanic_enc = pd.DataFrame(data=titanic_ohe, columns=encoded_values, index=df.index)
    df = df.join(titanic_enc)
    return df

In [40]:
def mm_scale_titanic(df):
    X = df[['age', 'fare']]
    scaler = preprocessing.MinMaxScaler(copy=True, feature_range=(0,1)).fit(X)
    X = scaler.transform(X)
    X = pd.DataFrame(X)
    df['age_mm'] = X.iloc[:, :1]
    df['fare_mm'] = X.iloc[:, 1:2]
    return df

In [41]:
def prep_titanic(df):
    """
    Takes in original titanic df generated by acquire.get_titanic_data() and returns
    a new df with transformations.
    Fills null values in embark_town and embarked with the most frequent entry: Southampton.
    Encodes embarked column as one_hot variables.
    Scales age and fare columns with min-max scaler.
    Drops columns ['species_id', 'measurement_id'] since they are obsolete.
    Splits the df into 80% train set, 20% test set
    """
    df.embark_town = df.embark_town.fillna('Southampton')
    df.embarked = df.embarked.fillna('S')
    df = ohe_encode_titanic(df)
    df = mm_scale_titanic(df)
    df = df.drop(columns=['deck', 'embarked', 'age', 'fare'])
    train, test = split_my_data(df)
    return train, test

In [42]:
titanic2 = acquire.get_titanic_data()
train_titanic, test_titanic = acquire.prep_titanic(titanic2)
train_titanic.head()

,passenger_id,survived,pclass,sex,sibsp,parch,class,embark_town,alone,C,Q,S,age_mm,fare_mm
179,179,0,3,male,0,0,Third,Southampton,1,0.0,0.0,1.0,0.447097,0.000000
442,442,0,3,male,1,0,Third,Southampton,0,0.0,0.0,1.0,0.308872,0.015176
469,469,1,3,female,2,1,Third,Cherbourg,0,1.0,0.0,0.0,0.004147,0.037590
178,178,0,2,male,0,0,Second,Southampton,1,0.0,0.0,1.0,0.371701,0.025374
254,254,0,3,female,0,2,Third,Southampton,0,0.0,0.0,1.0,0.509927,0.039452